Masmiseim36/nxpSDK/boards/twrk65f180m/project_template/pin_mux.h
/*! @name PORTD3 (coord B4), J26[A77]/U14[61]/FB_AD3/SDRAM_A11
  @{ */
#define BOARD_SDRAM_A11_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_A11_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                   /* @} */

/*! @name PORTD2 (coord A4), J26[A76]/U14[60]/FB_AD4/SDRAM_A12
  @{ */
#define BOARD_SDRAM_A12_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_A12_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                   /* @} */

/*! @name PORTC10 (coord A8), J26[A75]/U14[27]/FB_AD5/SDRAM_A13
  @{ */
#define BOARD_SDRAM_A13_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A13_PIN 10U    /*!<@brief PORTC pin index: 10 */
                                   /* @} */

/*! @name PORTC9 (coord C9), J26[A74]/U14[26]/FB_AD6/SDRAM_A14
  @{ */
#define BOARD_SDRAM_A14_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A14_PIN 9U     /*!<@brief PORTC pin index: 9 */
                                   /* @} */

/*! @name PORTC8 (coord C10), J26[A73]/U14[25]/FB_AD7/SDRAM_A15
  @{ */
#define BOARD_SDRAM_A15_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A15_PIN 8U     /*!<@brief PORTC pin index: 8 */
                                   /* @} */

/*! @name PORTC6 (coord A10), J26[A71]/U14[64]/FB_AD9/SDRAM_A17
  @{ */
#define BOARD_SDRAM_A17_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A17_PIN 6U     /*!<@brief PORTC pin index: 6 */
                                   /* @} */

/*! @name PORTC5 (coord A11), J26[A70]/U14[65]/FB_AD10/SDRAM_A18
  @{ */
#define BOARD_SDRAM_A18_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A18_PIN 5U     /*!<@brief PORTC pin index: 5 */
                                   /* @} */

/*! @name PORTC4 (coord B11), J26[A69]/U14[66]/FB_AD11/SDRAM_A19
  @{ */
#define BOARD_SDRAM_A19_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A19_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                   /* @} */

/*! @name PORTC2 (coord A13), J26[A68]/U14[24]/FB_AD12/SDRAM_A20
  @{ */
#define BOARD_SDRAM_A20_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A20_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                   /* @} */

/*! @name PORTC1 (coord B12), J26[A67]/U14[22]/FB_AD13/SDRAM_A21
  @{ */
#define BOARD_SDRAM_A21_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A21_PIN 1U     /*!<@brief PORTC pin index: 1 */
                                   /* @} */

/*! @name PORTC0 (coord B13), J26[A66]/U14[23]/FB_AD14/SDRAM_A22
  @{ */
#define BOARD_SDRAM_A22_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A22_PIN 0U     /*!<@brief PORTC pin index: 0 */
                                   /* @} */

/*! @name PORTD5 (coord C4), J26[A79]/U14[63]/FB_AD1/SDRAM_A9
  @{ */
#define BOARD_SDRAM_A9_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_A9_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                  /* @} */

/*! @name PORTB0 (coord G13), U14[18]/SDRAM_CAS
  @{ */
#define BOARD_SDRAM_CAS_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_CAS_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                   /* @} */

/*! @name PORTD7 (coord E5), U14[67]/SDRAM_CKE
  @{ */
#define BOARD_SDRAM_CKE_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_CKE_PIN 7U     /*!<@brief PORTD pin index: 7 */
                                   /* @} */

/*! @name PORTA6 (coord M10), J26[B27]/U14[68]/CLKOUT
  @{ */
#define BOARD_SDRAM_CLKOUT_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDRAM_CLKOUT_PIN 6U     /*!<@brief PORTA pin index: 6 */
                                      /* @} */

/*! @name PORTB3 (coord G10), U14[20]/SDRAM_CS0
  @{ */
#define BOARD_SDRAM_CS0_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_CS0_PIN 3U     /*!<@brief PORTB pin index: 3 */
                                   /* @} */

/*! @name PORTC29 (coord B6), U14[2]/SDRAM_D0
  @{ */
#define BOARD_SDRAM_D0_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D0_PIN 29U    /*!<@brief PORTC pin index: 29 */
                                  /* @} */

/*! @name PORTC28 (coord C6), U14[4]/SDRAM_D1
  @{ */
#define BOARD_SDRAM_D1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D1_PIN 28U    /*!<@brief PORTC pin index: 28 */
                                  /* @} */

/*! @name PORTA31 (coord J9), J26[B41]/U14[77]/SDRAM_D10/CAN0_RX
  @{ */
#define BOARD_SDRAM_D10_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDRAM_D10_PIN 31U    /*!<@brief PORTA pin index: 31 */
                                   /* @} */

/*! @name PORTA30 (coord H10), J26[B42]/U14[79]/SDRAM_D11/CAN0_TX
  @{ */
#define BOARD_SDRAM_D11_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDRAM_D11_PIN 30U    /*!<@brief PORTA pin index: 30 */
                                   /* @} */

/*! @name PORTA27 (coord H13), U14[80]/SDRAM_D12
  @{ */
#define BOARD_SDRAM_D12_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDRAM_D12_PIN 27U    /*!<@brief PORTA pin index: 27 */
                                   /* @} */

/*! @name PORTA26 (coord J10), U14[82]/SDRAM_D13
  @{ */
#define BOARD_SDRAM_D13_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDRAM_D13_PIN 26U    /*!<@brief PORTA pin index: 26 */
                                   /* @} */

/*! @name PORTA25 (coord J11), U14[83]/SDRAM_D14
  @{ */
#define BOARD_SDRAM_D14_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDRAM_D14_PIN 25U    /*!<@brief PORTA pin index: 25 */
                                   /* @} */

/*! @name PORTA24 (coord K11), U14[85]/SDRAM_D15
  @{ */
#define BOARD_SDRAM_D15_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDRAM_D15_PIN 24U    /*!<@brief PORTA pin index: 24 */
                                   /* @} */

