Masmiseim36/nxpSDK/boards/twrk65f180m/project_template/pin_mux.h
/*! @name PORTB17 (coord D13), J26[B67]/U14[31]/FB_AD16/SDRAM_D16
  @{ */
#define BOARD_SDRAM_D16_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D16_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                   /* @} */

/*! @name PORTB16 (coord F8), J26[B68]/U14[33]/FB_AD17/SDRAM_D17
  @{ */
#define BOARD_SDRAM_D17_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D17_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                   /* @} */

/*! @name PORTB11 (coord E13), J26[B69]/U14[34]/FB_AD18/SDRAM_D18
  @{ */
#define BOARD_SDRAM_D18_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D18_PIN 11U    /*!<@brief PORTB pin index: 11 */
                                   /* @} */

/*! @name PORTB10 (coord G9), J26[B70]/U14[36]/FB_AD19/SDRAM_D19
  @{ */
#define BOARD_SDRAM_D19_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D19_PIN 10U    /*!<@brief PORTB pin index: 10 */
                                   /* @} */

/*! @name PORTC27 (coord D6), U14[5]/SDRAM_D2
  @{ */
#define BOARD_SDRAM_D2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D2_PIN 27U    /*!<@brief PORTC pin index: 27 */
                                  /* @} */

/*! @name PORTB9 (coord F9), U14[37]/SDRAM_D20
  @{ */
#define BOARD_SDRAM_D20_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D20_PIN 9U     /*!<@brief PORTB pin index: 9 */
                                   /* @} */

/*! @name PORTB8 (coord F10), U14[39]/SDRAM_D21
  @{ */
#define BOARD_SDRAM_D21_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D21_PIN 8U     /*!<@brief PORTB pin index: 8 */
                                   /* @} */

/*! @name PORTB7 (coord F11), U14[40]/SDRAM_D22
  @{ */
#define BOARD_SDRAM_D22_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D22_PIN 7U     /*!<@brief PORTB pin index: 7 */
                                   /* @} */

/*! @name PORTB6 (coord F12), U14[42]/SDRAM_D23
  @{ */
#define BOARD_SDRAM_D23_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D23_PIN 6U     /*!<@brief PORTB pin index: 6 */
                                   /* @} */

/*! @name PORTC15 (coord D8), J26[B80]/U14[45]/FB_AD24/SDRAM_D24
  @{ */
#define BOARD_SDRAM_D24_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D24_PIN 15U    /*!<@brief PORTC pin index: 15 */
                                   /* @} */

/*! @name PORTC14 (coord C8), J26[B79]/U14[47]/FB_AD25/SDRAM_D25
  @{ */
#define BOARD_SDRAM_D25_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D25_PIN 14U    /*!<@brief PORTC pin index: 14 */
                                   /* @} */

/*! @name PORTC13 (coord B8), J26[B78]/U14[48]/FB_AD26/SDRAM_D26
  @{ */
#define BOARD_SDRAM_D26_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D26_PIN 13U    /*!<@brief PORTC pin index: 13 */
                                   /* @} */

/*! @name PORTC12 (coord B9), J26[B77]/U14[50]/FB_AD27/SDRAM_D27
  @{ */
#define BOARD_SDRAM_D27_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D27_PIN 12U    /*!<@brief PORTC pin index: 12 */
                                   /* @} */

/*! @name PORTB23 (coord C12), J26[B76]/U14[51]/FB_AD28/SDRAM_D28
  @{ */
#define BOARD_SDRAM_D28_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D28_PIN 23U    /*!<@brief PORTB pin index: 23 */
                                   /* @} */

/*! @name PORTB22 (coord C13), J26[B75]/U14[53]/FB_AD29/SDRAM_D29
  @{ */
#define BOARD_SDRAM_D29_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D29_PIN 22U    /*!<@brief PORTB pin index: 22 */
                                   /* @} */

/*! @name PORTC26 (coord E6), U14[7]/SDRAM_D3
  @{ */
#define BOARD_SDRAM_D3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D3_PIN 26U    /*!<@brief PORTC pin index: 26 */
                                  /* @} */

/*! @name PORTB21 (coord D9), J26[B74]/U14[54]/FB_AD30/SDRAM_D30
  @{ */
#define BOARD_SDRAM_D30_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D30_PIN 21U    /*!<@brief PORTB pin index: 21 */
                                   /* @} */

/*! @name PORTB20 (coord D10), J26[B73]/U14[56]/FB_AD31/SDRAM_D31
  @{ */
#define BOARD_SDRAM_D31_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D31_PIN 20U    /*!<@brief PORTB pin index: 20 */
                                   /* @} */

/*! @name PORTC25 (coord A7), U14[8]/SDRAM_D4
  @{ */
#define BOARD_SDRAM_D4_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D4_PIN 25U    /*!<@brief PORTC pin index: 25 */
                                  /* @} */

/*! @name PORTC24 (coord B7), U14[10]/SDRAM_D5
  @{ */
#define BOARD_SDRAM_D5_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D5_PIN 24U    /*!<@brief PORTC pin index: 24 */
                                  /* @} */

/*! @name PORTB15 (coord E9), U14[11]/SDRAM_D6
  @{ */
#define BOARD_SDRAM_D6_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D6_PIN 15U    /*!<@brief PORTB pin index: 15 */
                                  /* @} */

/*! @name PORTB14 (coord E10), U14[13]/SDRAM_D7
  @{ */
#define BOARD_SDRAM_D7_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D7_PIN 14U    /*!<@brief PORTB pin index: 14 */
                                  /* @} */

/*! @name PORTB13 (coord E11), U14[74]/SDRAM_D8
  @{ */
#define BOARD_SDRAM_D8_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D8_PIN 13U    /*!<@brief PORTB pin index: 13 */
                                  /* @} */

/*! @name PORTB12 (coord E12), U14[76]/SDRAM_D9
  @{ */
#define BOARD_SDRAM_D9_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D9_PIN 12U    /*!<@brief PORTB pin index: 12 */
                                  /* @} */

/*! @name PORTC19 (coord C7), U14[16]/SDRAM_DQM0
  @{ */
#define BOARD_SDRAM_DQM0_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_DQM0_PIN 19U    /*!<@brief PORTC pin index: 19 */
                                    /* @} */

/*! @name PORTC18 (coord D7), U14[71]/SDRAM_DQM1
  @{ */
#define BOARD_SDRAM_DQM1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_DQM1_PIN 18U    /*!<@brief PORTC pin index: 18 */
                                    /* @} */

/*! @name PORTC16 (coord E8), U14[28]/SDRAM_DQM2
  @{ */
#define BOARD_SDRAM_DQM2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_DQM2_PIN 16U    /*!<@brief PORTC pin index: 16 */
                                    /* @} */

/*! @name PORTC17 (coord E7), U14[59]/SDRAM_DQM3
  @{ */
#define BOARD_SDRAM_DQM3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_DQM3_PIN 17U    /*!<@brief PORTC pin index: 17 */
                                    /* @} */

/*! @name PORTB1 (coord G12), U14[19]/SDRAM_RAS
  @{ */
#define BOARD_SDRAM_RAS_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_RAS_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                   /* @} */

/*! @name PORTB2 (coord G11), U14[17]/SDRAM_WE
  @{ */
#define BOARD_SDRAM_WE_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_WE_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void);

/*!
 * @brief Digital Filter Enable Mask for item 15. */
#define PORT_DFER_DFE_15_MASK 0x8000u
/*!
 * @brief Digital Filter Enable Mask for item 8. */
#define PORT_DFER_DFE_8_MASK 0x0100u
/*!
 * @brief Digital Filter Enable Mask for item 9. */
#define PORT_DFER_DFE_9_MASK 0x0200u
/*!
 * @brief
 * Selects the default input voltage source to the USB Regulator in case both VREG_IN0 and VREG_IN1 are powered.
 * If only one of the regulator inputs is powered, it will automatically be selected by the regulator's power mux
 * circuitry.
 * : VREG_IN0 will be selected if both regulator inputs are powered.
 */
#define USBPHYCTL_USBVREGSEL_VREG_IN0 0x00u

/*! @name PORTD8 (coord D5), J13[2]/U12[3]/microUSB_PWR_EN
  @{ */
#define BOARD_microUSB_PWR_EN_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_microUSB_PWR_EN_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_microUSB_PWR_EN_PIN 8U     /*!<@brief PORTD pin index: 8 */
                                         /* @} */

