Masmiseim36/nxpSDK/boards/twrk65f180m/project_template/pin_mux.h
/*! @name PORTD15 (coord A3), J12[11]/J15[4]/J26[B47]/microUSB_ID/SPI2_PCS1
  @{ */
#define BOARD_microUSB_ID_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_microUSB_ID_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_microUSB_ID_PIN 15U    /*!<@brief PORTD pin index: 15 */
                                     /* @} */

/*! @name USB1_DP (coord J1), J15[3]/MCU_USB1_HS_DP
  @{ */
/* @} */

/*! @name USB1_DM (coord H1), J15[2]/MCU_USB1_HS_DN
  @{ */
/* @} */

/*! @name USB1_VBUS (coord J2), J15[1]/U12[6]/K65_USB1_VBUS
  @{ */
/* @} */

/*! @name VREG_IN0 (coord F2), J23[2]/MCU_VREGIN0
  @{ */
/* @} */

/*! @name VREG_OUT (coord G2), J9[7]/MCU_VREGOUT
  @{ */
/* @} */

/*! @name PORTD9 (coord D4), J14[1]/U12[4]/K65_USB_FLGA
  @{ */
#define BOARD_K65_USB_FLGA_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_K65_USB_FLGA_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_K65_USB_FLGA_PIN 9U     /*!<@brief PORTD pin index: 9 */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void);

/*! @name PORTE3 (coord D1), J26[B10]/J29[3]/SDHC0_CMD/SPI1_SIN
  @{ */
#define BOARD_SDHC_CMD_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_CMD_PIN 3U     /*!<@brief PORTE pin index: 3 */
                                  /* @} */

/*! @name PORTE1 (coord B1), J26[B11]/J29[7]/SDHC0_D0/SPI1_SOUT
  @{ */
#define BOARD_SDHC_D0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_D0_PIN 1U     /*!<@brief PORTE pin index: 1 */
                                 /* @} */

/*! @name PORTE0 (coord A1), J26[B22]/J29[8]/SDHC0_D1
  @{ */
#define BOARD_SDHC_D1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_D1_PIN 0U     /*!<@brief PORTE pin index: 0 */
                                 /* @} */

/*! @name PORTE5 (coord D2), J26[A10]/J29[1]/SDHC0_D2
  @{ */
#define BOARD_SDHC_D2_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_D2_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                 /* @} */

/*! @name PORTE4 (coord E1), J26[B9]/J29[2]/SDHC0_D3/SPI1_PCS0
  @{ */
#define BOARD_SDHC_D3_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_D3_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                 /* @} */

/*! @name PORTE2 (coord C1), J26[B7]/J29[5]/SDHC0_DCLK/SPI1_SCK
  @{ */
#define BOARD_SDHC_DCLK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_DCLK_PIN 2U     /*!<@brief PORTE pin index: 2 */
                                   /* @} */

/*! @name PORTA9 (coord K10), J26[A11]/J29[9]/SD_DETECT
  @{ */
#define BOARD_SDHC_CD_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_SDHC_CD_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC_CD_PIN 9U     /*!<@brief PORTA pin index: 9 */
                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void);

#define SOPT2_RMIISRC_ENET 0x01u /*!<@brief RMII clock source select: External bypass clock (ENET_1588_CLKIN). */

/*! @name PORTE26 (coord K8), J26[B24]/ENET_1588_CLKIN
  @{ */
#define BOARD_ENET_1588_CLKIN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_ENET_1588_CLKIN_PIN 26U    /*!<@brief PORTE pin index: 26 */
                                         /* @} */

/*! @name PORTE26 (coord K8), J26[B24]/ENET_1588_CLKIN
  @{ */
#define BOARD_RMII_CLKIN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_RMII_CLKIN_PIN 26U    /*!<@brief PORTE pin index: 26 */
                                    /* @} */

/*! @name PORTA8 (coord K9), J26[A13]/RMII0_MDC
  @{ */
#define BOARD_RMII0_MDC_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_MDC_PIN 8U     /*!<@brief PORTA pin index: 8 */
                                   /* @} */

/*! @name PORTA7 (coord L10), J26[A14]/RMII0_MDIO
  @{ */
#define BOARD_RMII0_MDIO_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_MDIO_PIN 7U     /*!<@brief PORTA pin index: 7 */
                                    /* @} */

/*! @name PORTA5 (coord N10), J26[B13]/RMII0_RXER
  @{ */
#define BOARD_RMII0_RXER_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_RXER_PIN 5U     /*!<@brief PORTA pin index: 5 */
                                    /* @} */

/*! @name PORTA13 (coord L11), J26[A20]/RMII0_RXD0
  @{ */
#define BOARD_RMII0_RXD0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_RXD0_PIN 13U    /*!<@brief PORTA pin index: 13 */
                                    /* @} */

/*! @name PORTA17 (coord J12), J26[B19]/RMII0_TXD1
  @{ */
#define BOARD_RMII0_TXD1_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_TXD1_PIN 17U    /*!<@brief PORTA pin index: 17 */
                                    /* @} */

/*! @name PORTA15 (coord K12), J26[B15]/RMII0_TXEN
  @{ */
#define BOARD_RMII0_TXEN_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_TXEN_PIN 15U    /*!<@brief PORTA pin index: 15 */
                                    /* @} */

/*! @name PORTA12 (coord L12), J26[A19]/RMII0_RXD1
  @{ */
#define BOARD_RMII0_RXD1_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_RXD1_PIN 12U    /*!<@brief PORTA pin index: 12 */
                                    /* @} */

/*! @name PORTA16 (coord J13), J26[B20]/RMII0_TXD0
  @{ */
#define BOARD_RMII0_TXD0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_TXD0_PIN 16U    /*!<@brief PORTA pin index: 16 */
                                    /* @} */

/*! @name PORTA14 (coord K13), J26[A16]/RMII0_CRS_DV
  @{ */
#define BOARD_RMII0_CRS_DV_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_CRS_DV_PIN 14U    /*!<@brief PORTA pin index: 14 */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENETPins(void);

/*! @name XTAL32 (coord N5), Y1[1]/XTAL32
  @{ */
/* @} */

/*! @name EXTAL32 (coord N6), Y1[2]/EXTAL32
  @{ */
/* @} */

/*! @name PORTA19 (coord M13), Y2[1]/XTAL0
  @{ */
#define BOARD_XTAL0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_XTAL0_PIN 19U    /*!<@brief PORTA pin index: 19 */
                               /* @} */

/*! @name PORTA18 (coord N13), Y2[3]/EXTAL0
  @{ */
#define BOARD_EXTAL0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_EXTAL0_PIN 18U    /*!<@brief PORTA pin index: 18 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCsPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
